kafka/gce/bench-results.bak/direct/2016-07-11.08-55/producers/client-2.log
2016:07:11 06:56:16,1525 records sent, 304.9 records/sec (29.77 MB/sec), 9.6 ms avg latency, 289.0 max latency.
2016:07:11 06:56:21,1530 records sent, 305.9 records/sec (29.88 MB/sec), 3.2 ms avg latency, 64.0 max latency.
2016:07:11 06:56:26,1529 records sent, 305.7 records/sec (29.85 MB/sec), 2.4 ms avg latency, 65.0 max latency.
2016:07:11 06:56:31,1545 records sent, 309.0 records/sec (30.18 MB/sec), 1.8 ms avg latency, 38.0 max latency.
2016:07:11 06:56:36,1532 records sent, 306.4 records/sec (29.92 MB/sec), 2.0 ms avg latency, 41.0 max latency.
2016:07:11 06:56:41,1541 records sent, 308.1 records/sec (30.09 MB/sec), 1.9 ms avg latency, 40.0 max latency.
2016:07:11 06:56:46,1553 records sent, 310.4 records/sec (30.31 MB/sec), 1.9 ms avg latency, 39.0 max latency.
2016:07:11 06:56:51,1550 records sent, 310.0 records/sec (30.27 MB/sec), 1.8 ms avg latency, 40.0 max latency.
2016:07:11 06:56:56,1549 records sent, 309.7 records/sec (30.25 MB/sec), 19.0 ms avg latency, 332.0 max latency.
2016:07:11 06:57:01,1551 records sent, 310.2 records/sec (30.29 MB/sec), 1.9 ms avg latency, 39.0 max latency.
2016:07:11 06:57:06,1552 records sent, 310.3 records/sec (30.30 MB/sec), 1.9 ms avg latency, 39.0 max latency.
2016:07:11 06:57:11,1548 records sent, 309.6 records/sec (30.23 MB/sec), 22.8 ms avg latency, 401.0 max latency.
2016:07:11 06:57:16,1553 records sent, 310.5 records/sec (30.33 MB/sec), 1.9 ms avg latency, 36.0 max latency.
2016:07:11 06:57:21,1552 records sent, 310.4 records/sec (30.31 MB/sec), 1.8 ms avg latency, 40.0 max latency.
2016:07:11 06:57:26,1553 records sent, 310.5 records/sec (30.33 MB/sec), 2.1 ms avg latency, 40.0 max latency.
2016:07:11 06:57:31,1551 records sent, 310.1 records/sec (30.28 MB/sec), 1.9 ms avg latency, 38.0 max latency.
2016:07:11 06:57:36,1548 records sent, 309.5 records/sec (30.23 MB/sec), 1.8 ms avg latency, 43.0 max latency.
2016:07:11 06:57:41,1550 records sent, 310.0 records/sec (30.27 MB/sec), 11.6 ms avg latency, 266.0 max latency.
2016:07:11 06:57:46,1553 records sent, 310.6 records/sec (30.33 MB/sec), 11.0 ms avg latency, 258.0 max latency.
2016:07:11 06:57:51,1552 records sent, 310.2 records/sec (30.29 MB/sec), 1.7 ms avg latency, 39.0 max latency.
2016:07:11 06:57:56,1553 records sent, 310.6 records/sec (30.33 MB/sec), 2.0 ms avg latency, 38.0 max latency.
2016:07:11 06:58:01,1551 records sent, 310.1 records/sec (30.28 MB/sec), 2.5 ms avg latency, 66.0 max latency.
2016:07:11 06:58:06,1551 records sent, 310.2 records/sec (30.29 MB/sec), 1.9 ms avg latency, 38.0 max latency.
2016:07:11 06:58:11,1552 records sent, 310.2 records/sec (30.29 MB/sec), 1.7 ms avg latency, 35.0 max latency.
2016:07:11 06:58:16,1552 records sent, 310.4 records/sec (30.31 MB/sec), 2.8 ms avg latency, 67.0 max latency.
2016:07:11 06:58:21,1551 records sent, 310.2 records/sec (30.29 MB/sec), 15.3 ms avg latency, 321.0 max latency.
2016:07:11 06:58:26,1552 records sent, 310.4 records/sec (30.31 MB/sec), 1.8 ms avg latency, 40.0 max latency.
2016:07:11 06:58:31,1552 records sent, 310.3 records/sec (30.31 MB/sec), 2.1 ms avg latency, 43.0 max latency.
2016:07:11 06:58:36,1550 records sent, 309.8 records/sec (30.26 MB/sec), 15.7 ms avg latency, 332.0 max latency.
2016:07:11 06:58:41,1551 records sent, 310.1 records/sec (30.28 MB/sec), 1.7 ms avg latency, 39.0 max latency.
2016:07:11 06:58:46,1554 records sent, 310.8 records/sec (30.35 MB/sec), 1.9 ms avg latency, 44.0 max latency.
2016:07:11 06:58:51,1553 records sent, 310.5 records/sec (30.33 MB/sec), 2.3 ms avg latency, 60.0 max latency.
2016:07:11 06:58:56,1554 records sent, 310.7 records/sec (30.34 MB/sec), 1.9 ms avg latency, 35.0 max latency.
2016:07:11 06:59:01,1553 records sent, 310.5 records/sec (30.33 MB/sec), 1.7 ms avg latency, 37.0 max latency.
2016:07:11 06:59:06,1554 records sent, 310.7 records/sec (30.35 MB/sec), 1.9 ms avg latency, 38.0 max latency.
2016:07:11 06:59:11,1554 records sent, 310.7 records/sec (30.34 MB/sec), 3.3 ms avg latency, 71.0 max latency.
2016:07:11 06:59:16,1551 records sent, 310.1 records/sec (30.28 MB/sec), 3.9 ms avg latency, 83.0 max latency.
2016:07:11 06:59:21,1551 records sent, 310.1 records/sec (30.29 MB/sec), 7.8 ms avg latency, 118.0 max latency.
2016:07:11 06:59:26,1551 records sent, 310.2 records/sec (30.29 MB/sec), 24.7 ms avg latency, 277.0 max latency.
2016:07:11 06:59:31,1538 records sent, 307.4 records/sec (30.02 MB/sec), 236.0 ms avg latency, 993.0 max latency.
2016:07:11 06:59:36,1542 records sent, 308.2 records/sec (30.09 MB/sec), 23.9 ms avg latency, 149.0 max latency.
2016:07:11 06:59:41,1566 records sent, 313.2 records/sec (30.59 MB/sec), 9.4 ms avg latency, 172.0 max latency.
2016:07:11 06:59:46,1258 records sent, 251.5 records/sec (24.57 MB/sec), 560.9 ms avg latency, 1969.0 max latency.
2016:07:11 06:59:51,1529 records sent, 305.7 records/sec (29.86 MB/sec), 6.3 ms avg latency, 87.0 max latency.
2016:07:11 06:59:56,1540 records sent, 307.9 records/sec (30.07 MB/sec), 12.9 ms avg latency, 202.0 max latency.
2016:07:11 07:00:01,1551 records sent, 310.0 records/sec (30.27 MB/sec), 46.0 ms avg latency, 355.0 max latency.
2016:07:11 07:00:06,1556 records sent, 311.1 records/sec (30.38 MB/sec), 4.8 ms avg latency, 69.0 max latency.
2016:07:11 07:00:11,1553 records sent, 310.6 records/sec (30.33 MB/sec), 5.5 ms avg latency, 118.0 max latency.
2016:07:11 07:00:16,1555 records sent, 310.8 records/sec (30.35 MB/sec), 10.5 ms avg latency, 250.0 max latency.
2016:07:11 07:00:21,1551 records sent, 310.2 records/sec (30.29 MB/sec), 1.6 ms avg latency, 41.0 max latency.
2016:07:11 07:00:26,1556 records sent, 311.1 records/sec (30.38 MB/sec), 1.7 ms avg latency, 37.0 max latency.
2016:07:11 07:00:31,1553 records sent, 310.6 records/sec (30.33 MB/sec), 1.6 ms avg latency, 39.0 max latency.
2016:07:11 07:00:36,1555 records sent, 310.9 records/sec (30.37 MB/sec), 14.1 ms avg latency, 311.0 max latency.
2016:07:11 07:00:41,1555 records sent, 311.0 records/sec (30.37 MB/sec), 1.7 ms avg latency, 41.0 max latency.
2016:07:11 07:00:46,1553 records sent, 310.5 records/sec (30.32 MB/sec), 1.7 ms avg latency, 36.0 max latency.
2016:07:11 07:00:51,1554 records sent, 310.8 records/sec (30.35 MB/sec), 2.9 ms avg latency, 77.0 max latency.
2016:07:11 07:00:56,1556 records sent, 311.1 records/sec (30.38 MB/sec), 2.7 ms avg latency, 78.0 max latency.
2016:07:11 07:01:01,1554 records sent, 310.8 records/sec (30.35 MB/sec), 1.8 ms avg latency, 37.0 max latency.
2016:07:11 07:01:06,1556 records sent, 311.0 records/sec (30.37 MB/sec), 2.1 ms avg latency, 56.0 max latency.
2016:07:11 07:01:11,1551 records sent, 310.2 records/sec (30.29 MB/sec), 18.4 ms avg latency, 354.0 max latency.
2016:07:11 07:01:16,1550 records sent, 310.0 records/sec (30.27 MB/sec), 3.8 ms avg latency, 111.0 max latency.
2016:07:11 07:01:22,1535 records sent, 306.9 records/sec (29.97 MB/sec), 1.7 ms avg latency, 37.0 max latency.
2016:07:11 07:01:27,1547 records sent, 309.3 records/sec (30.20 MB/sec), 2.1 ms avg latency, 44.0 max latency.
2016:07:11 07:01:32,1555 records sent, 310.9 records/sec (30.36 MB/sec), 1.9 ms avg latency, 40.0 max latency.
2016:07:11 07:01:37,1553 records sent, 310.6 records/sec (30.33 MB/sec), 1.7 ms avg latency, 40.0 max latency.
2016:07:11 07:01:42,1552 records sent, 310.4 records/sec (30.31 MB/sec), 24.3 ms avg latency, 316.0 max latency.
2016:07:11 07:01:47,1554 records sent, 310.8 records/sec (30.35 MB/sec), 12.9 ms avg latency, 281.0 max latency.
2016:07:11 07:01:52,1555 records sent, 310.9 records/sec (30.37 MB/sec), 1.7 ms avg latency, 39.0 max latency.
2016:07:11 07:01:57,1555 records sent, 310.9 records/sec (30.36 MB/sec), 1.8 ms avg latency, 35.0 max latency.
2016:07:11 07:02:02,1553 records sent, 310.5 records/sec (30.33 MB/sec), 9.4 ms avg latency, 226.0 max latency.
2016:07:11 07:02:07,1552 records sent, 310.3 records/sec (30.31 MB/sec), 1.7 ms avg latency, 37.0 max latency.
2016:07:11 07:02:12,1553 records sent, 310.5 records/sec (30.32 MB/sec), 1.8 ms avg latency, 35.0 max latency.
2016:07:11 07:02:17,1553 records sent, 310.5 records/sec (30.32 MB/sec), 1.9 ms avg latency, 37.0 max latency.
2016:07:11 07:02:22,1554 records sent, 310.8 records/sec (30.35 MB/sec), 16.0 ms avg latency, 338.0 max latency.
2016:07:11 07:02:27,1554 records sent, 310.7 records/sec (30.35 MB/sec), 1.7 ms avg latency, 42.0 max latency.
2016:07:11 07:02:32,1553 records sent, 310.5 records/sec (30.32 MB/sec), 16.1 ms avg latency, 331.0 max latency.
2016:07:11 07:02:37,1556 records sent, 311.2 records/sec (30.39 MB/sec), 9.3 ms avg latency, 240.0 max latency.
2016:07:11 07:02:42,1558 records sent, 311.5 records/sec (30.42 MB/sec), 1.6 ms avg latency, 37.0 max latency.
2016:07:11 07:02:47,1555 records sent, 310.9 records/sec (30.37 MB/sec), 1.8 ms avg latency, 37.0 max latency.
2016:07:11 07:02:52,1557 records sent, 311.3 records/sec (30.40 MB/sec), 1.9 ms avg latency, 37.0 max latency.
2016:07:11 07:02:57,1555 records sent, 310.9 records/sec (30.37 MB/sec), 1.8 ms avg latency, 37.0 max latency.
2016:07:11 07:02:59,126000 records sent, 309.200936 records/sec (30.20 MB/sec), 14.49 ms avg latency, 1969.00 ms max latency, 1 ms 50th, 30 ms 95th, 286 ms 99th, 1734 ms 99.9th.